app/controllers/group_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."category_id" = $1  [["category_id", 1]]
---
  def index
    @group = @category.groups

INSERT INTO "groups" ("name", "description", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Group 1"], ["description", "welcome group 1"], ["category_id", 1], ["created_at", 2017-03-26 10:44:19 UTC], ["updated_at", 2017-03-26 10:44:19 UTC]]
---
  def create
    @groups = Group.new(group_params)
    @groups.category = @category

    respond_to do |format|
      if @groups.save

DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]
---
  def destroy
    @groups.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_category
      @category = Category.find(params[:category_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_group
      @groups = Group.find(params[:id])