app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.group = @groups
    @post.user = @current_user

    respond_to do |format|
      if @post.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("name", "content", "user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Post 1"], ["content", "content 1"], ["user_id", 1], ["group_id", 1], ["created_at", 2017-03-26 10:46:18 UTC], ["updated_at", 2017-03-26 10:46:18 UTC]]

    def set_group
      @groups = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]